{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "fad76b97",
   "metadata": {},
   "source": [
    "<h1 align=\"center\">Play Memgraph with ORE Data</h1>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4595587e",
   "metadata": {},
   "source": [
    "# Table of contents <a name=\"toc\"></a>\n",
    "1. [Introduction](#introduction)\n",
    "2. [Prerequisites](#prerequisites)\n",
    "3. [Requirements](#requirements)\n",
    "4. [Source Dataset](#dataset)\n",
    "5. [Connect to Memgraph with GQLAlchemy](#connect)\n",
    "6. [Define a Graph Data Model](#graph-schema)\n",
    "7. [Creating and returning nodes and relationships](#create-return)\n",
    "8. [Importing data from CSV files](#import)\n",
    "9. [Querying the database and retrieving results](#query)\n",
    "10. [Use Case queries](#exercises)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d4ee4433",
   "metadata": {},
   "source": [
    "## 1. Introduction <a name=\"introduction\"></a>\n",
    "\n",
    "Through this demo, we will create a graph model from a dataset, run Memgraph with Docker, connect to it from a Jupyter Notebook with the help of GQLAlchemy, and perform simple queries. "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "172070f5",
   "metadata": {},
   "source": [
    "## 2. Prerequisites <a name=\"prerequisites\"></a>\n",
    "\n",
    "For this demo, we need to install:\n",
    "\n",
    "- [Jupyter](https://jupyter.org/install) - to run the Jupyter notebook\n",
    "- [Docker](https://docs.docker.com/get-docker/) - to run Memgraph, since Memgraph is a native Linux application and cannot be installed on Windows and macOS\n",
    "- [CMake](https://cmake.org/install/) - a prerequisite for GQLAlchemy\n",
    "- [Memgraph Platform](https://memgraph.com/docs/memgraph/installation) - the complete streaming graph application platform; follow the instructions to install Memgraph Platform with Docker for your OS\n",
    "\n",
    "> ### Memgraph Platform installation using Docker\n",
    ">\n",
    "> After we install Docker, we can run the Memgraph Platform container by running:\n",
    ">\n",
    ">```\n",
    ">docker run -it -p 7687:7687 -p 7444:7444 -p 3000:3000 memgraph/memgraph-platform:2.4.0\n",
    ">```\n",
    ">\n",
    ">**Memgraph Platform** contains:\n",
    ">\n",
    ">- **MemgraphDB** - the database that holds your data\n",
    ">- **Memgraph Lab** - visual user interface for running queries and visualizing graph data (running at `localhost:3000`)\n",
    ">- **mgconsole** - command-line interface for running queries\n",
    ">- **MAGE** - graph algorithms and modules library\n",
    "\n",
    "## 3. Requirements  <a name=\"requirements\"></a>\n",
    "\n",
    "For this demo, we need to install the following Python libraries:\n",
    "\n",
    "- [GQLAlchemy](https://pypi.org/project/gqlalchemy/)\n",
    "- [Pandas](https://pypi.org/project/pandas/)\n",
    "\n",
    "All info about the versions can be found in the [requirements.txt] file."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "70d165b5",
   "metadata": {},
   "source": [
    "## 4. Source Dataset <a name=\"dataset\"></a>\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "20c7a796",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>site_number</th>\n",
       "      <th>store_code</th>\n",
       "      <th>site_name</th>\n",
       "      <th>site_address</th>\n",
       "      <th>latitude</th>\n",
       "      <th>longitude</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1001</td>\n",
       "      <td>WDAZ01</td>\n",
       "      <td>DTD PHOENIX AZ (WDAZ01)</td>\n",
       "      <td>2300 S 51ST AVESTE 140</td>\n",
       "      <td>33.426933</td>\n",
       "      <td>-112.171425</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1002</td>\n",
       "      <td>AZF 01</td>\n",
       "      <td>S MILTON (AZF 01)</td>\n",
       "      <td>1230 S MILTON RD</td>\n",
       "      <td>35.188653</td>\n",
       "      <td>-111.661367</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1003</td>\n",
       "      <td>AZP 01</td>\n",
       "      <td>EAST THOMAS (AZP 01)</td>\n",
       "      <td>3234 E THOMAS RD</td>\n",
       "      <td>33.480606</td>\n",
       "      <td>-112.011124</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1005</td>\n",
       "      <td>AZP 03</td>\n",
       "      <td>MAIN (AZP 03)</td>\n",
       "      <td>1929 W MAIN ST</td>\n",
       "      <td>33.414660</td>\n",
       "      <td>-111.873261</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1007</td>\n",
       "      <td>AZP 05</td>\n",
       "      <td>SOUTHERN (AZP 05)</td>\n",
       "      <td>1709 E SOUTHERN AVE</td>\n",
       "      <td>33.391693</td>\n",
       "      <td>-111.911027</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   site_number store_code                site_name            site_address  \\\n",
       "0         1001     WDAZ01  DTD PHOENIX AZ (WDAZ01)  2300 S 51ST AVESTE 140   \n",
       "1         1002     AZF 01        S MILTON (AZF 01)        1230 S MILTON RD   \n",
       "2         1003     AZP 01     EAST THOMAS (AZP 01)        3234 E THOMAS RD   \n",
       "3         1005     AZP 03            MAIN (AZP 03)          1929 W MAIN ST   \n",
       "4         1007     AZP 05        SOUTHERN (AZP 05)     1709 E SOUTHERN AVE   \n",
       "\n",
       "    latitude   longitude  \n",
       "0  33.426933 -112.171425  \n",
       "1  35.188653 -111.661367  \n",
       "2  33.480606 -112.011124  \n",
       "3  33.414660 -111.873261  \n",
       "4  33.391693 -111.911027  "
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "site = pd.read_csv(\"../data/site.csv\")\n",
    "site.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "f0b85d47-b122-4b6a-8c64-22f4bce221f1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "site_number     1408\n",
       "store_code      1408\n",
       "site_name       1408\n",
       "site_address    1408\n",
       "latitude        1401\n",
       "longitude       1401\n",
       "dtype: int64"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "site.count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "4a9ce339-0b3b-4205-817b-1d71ef06b75f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "site_number        1408\n",
       "store_code         1408\n",
       "site_name          1408\n",
       "site_address       1408\n",
       "latitude           1401\n",
       "longitude          1401\n",
       "store_code_rank    1408\n",
       "dtype: int64"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "site['store_code_rank'] = site.groupby('site_number')['store_code'].rank(method='first')\n",
    "df = site[site['store_code_rank']==1]\n",
    "df = df.drop('store_code_rank', axis=1)\n",
    "site.count()\n",
    "# df.to_csv('../data/article_inventory.csv', index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "d2a68081",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>article_number</th>\n",
       "      <th>article_type_code</th>\n",
       "      <th>created_date</th>\n",
       "      <th>manufacturer_code</th>\n",
       "      <th>gross_weight</th>\n",
       "      <th>net_weight</th>\n",
       "      <th>speed_rating_code</th>\n",
       "      <th>tire_cross_section_number</th>\n",
       "      <th>tire_aspect_ratio</th>\n",
       "      <th>tire_rim_size_number</th>\n",
       "      <th>...</th>\n",
       "      <th>wheel_offset_number</th>\n",
       "      <th>wheel_diameter_number</th>\n",
       "      <th>wheel_style_code</th>\n",
       "      <th>wheel_bolt_pattern</th>\n",
       "      <th>wheel_accent_code</th>\n",
       "      <th>spoke_100mm_depth</th>\n",
       "      <th>spoke_120mm_depth</th>\n",
       "      <th>spoke_160mm_depth</th>\n",
       "      <th>spoke_90mm_depth</th>\n",
       "      <th>merchandise_category_code</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10000</td>\n",
       "      <td>ZPRO</td>\n",
       "      <td>2014-09-03</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.00</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>300056</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>10001</td>\n",
       "      <td>ZTIR</td>\n",
       "      <td>2014-09-15</td>\n",
       "      <td>FAL</td>\n",
       "      <td>54.0</td>\n",
       "      <td>53.50</td>\n",
       "      <td>Q</td>\n",
       "      <td>245</td>\n",
       "      <td>75.0</td>\n",
       "      <td>16.0</td>\n",
       "      <td>...</td>\n",
       "      <td>30.57</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>300001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>10002</td>\n",
       "      <td>ZTIR</td>\n",
       "      <td>2014-09-15</td>\n",
       "      <td>FAL</td>\n",
       "      <td>55.0</td>\n",
       "      <td>54.30</td>\n",
       "      <td>S</td>\n",
       "      <td>265</td>\n",
       "      <td>70.0</td>\n",
       "      <td>17.0</td>\n",
       "      <td>...</td>\n",
       "      <td>31.80</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>300001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>10003</td>\n",
       "      <td>ZTIR</td>\n",
       "      <td>2014-08-22</td>\n",
       "      <td>NIT</td>\n",
       "      <td>32.0</td>\n",
       "      <td>31.97</td>\n",
       "      <td>W</td>\n",
       "      <td>245</td>\n",
       "      <td>55.0</td>\n",
       "      <td>18.0</td>\n",
       "      <td>...</td>\n",
       "      <td>28.54</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>300000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>10004</td>\n",
       "      <td>ZTIR</td>\n",
       "      <td>2014-09-15</td>\n",
       "      <td>FAL</td>\n",
       "      <td>61.0</td>\n",
       "      <td>60.50</td>\n",
       "      <td>Q</td>\n",
       "      <td>275</td>\n",
       "      <td>65.0</td>\n",
       "      <td>18.0</td>\n",
       "      <td>...</td>\n",
       "      <td>32.16</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>300001</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 23 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   article_number article_type_code created_date manufacturer_code  \\\n",
       "0           10000              ZPRO   2014-09-03               NaN   \n",
       "1           10001              ZTIR   2014-09-15               FAL   \n",
       "2           10002              ZTIR   2014-09-15               FAL   \n",
       "3           10003              ZTIR   2014-08-22               NIT   \n",
       "4           10004              ZTIR   2014-09-15               FAL   \n",
       "\n",
       "   gross_weight  net_weight speed_rating_code tire_cross_section_number  \\\n",
       "0           0.0        0.00               NaN                       NaN   \n",
       "1          54.0       53.50                 Q                       245   \n",
       "2          55.0       54.30                 S                       265   \n",
       "3          32.0       31.97                 W                       245   \n",
       "4          61.0       60.50                 Q                       275   \n",
       "\n",
       "   tire_aspect_ratio  tire_rim_size_number  ...  wheel_offset_number  \\\n",
       "0                NaN                   NaN  ...                  NaN   \n",
       "1               75.0                  16.0  ...                30.57   \n",
       "2               70.0                  17.0  ...                31.80   \n",
       "3               55.0                  18.0  ...                28.54   \n",
       "4               65.0                  18.0  ...                32.16   \n",
       "\n",
       "   wheel_diameter_number  wheel_style_code  wheel_bolt_pattern  \\\n",
       "0                    NaN               NaN                 NaN   \n",
       "1                    NaN               NaN                 NaN   \n",
       "2                    NaN               NaN                 NaN   \n",
       "3                    NaN               NaN                 NaN   \n",
       "4                    NaN               NaN                 NaN   \n",
       "\n",
       "   wheel_accent_code spoke_100mm_depth spoke_120mm_depth spoke_160mm_depth  \\\n",
       "0                NaN               NaN               NaN               NaN   \n",
       "1                NaN               NaN               NaN               NaN   \n",
       "2                NaN               NaN               NaN               NaN   \n",
       "3                NaN               NaN               NaN               NaN   \n",
       "4                NaN               NaN               NaN               NaN   \n",
       "\n",
       "   spoke_90mm_depth  merchandise_category_code  \n",
       "0               NaN                     300056  \n",
       "1               NaN                     300001  \n",
       "2               NaN                     300001  \n",
       "3               NaN                     300000  \n",
       "4               NaN                     300001  \n",
       "\n",
       "[5 rows x 23 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "article = pd.read_csv(\"../data/product.csv\")\n",
    "article.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "ef251449-35c5-4583-8406-57c2a1746b53",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "article_number               50000\n",
       "article_type_code            50000\n",
       "created_date                 50000\n",
       "manufacturer_code            49980\n",
       "gross_weight                 50000\n",
       "net_weight                   50000\n",
       "speed_rating_code            28182\n",
       "tire_cross_section_number    28832\n",
       "tire_aspect_ratio            28626\n",
       "tire_rim_size_number         28832\n",
       "tread_depth                  28832\n",
       "tire_load_capacity           28832\n",
       "tire_load_index              28832\n",
       "wheel_offset_number          28832\n",
       "wheel_diameter_number        20915\n",
       "wheel_style_code             20915\n",
       "wheel_bolt_pattern           20915\n",
       "wheel_accent_code            20915\n",
       "spoke_100mm_depth            20915\n",
       "spoke_120mm_depth            20915\n",
       "spoke_160mm_depth            20915\n",
       "spoke_90mm_depth             20915\n",
       "merchandise_category_code    50000\n",
       "dtype: int64"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "article.count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "262ab4c1-fa93-47e0-be2e-7761b4e800e3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>employee_identifier</th>\n",
       "      <th>site_number</th>\n",
       "      <th>full_name</th>\n",
       "      <th>employee_type_name</th>\n",
       "      <th>employment_status_code</th>\n",
       "      <th>position_effective_start_date</th>\n",
       "      <th>effective_termination_date</th>\n",
       "      <th>position_name</th>\n",
       "      <th>position_job_code</th>\n",
       "      <th>original_hire_date</th>\n",
       "      <th>create_timestamp</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>316846</td>\n",
       "      <td>2199</td>\n",
       "      <td>Pickens, Jacob H</td>\n",
       "      <td>Full time</td>\n",
       "      <td>A</td>\n",
       "      <td>2024-08-01</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Store Manager</td>\n",
       "      <td>1752</td>\n",
       "      <td>2000-10-09</td>\n",
       "      <td>2024-03-12 21:44:27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>525040</td>\n",
       "      <td>2199</td>\n",
       "      <td>Apodaca Cordova, Jesus A</td>\n",
       "      <td>Full time</td>\n",
       "      <td>A</td>\n",
       "      <td>2023-04-23</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Store Sr Asst Manager</td>\n",
       "      <td>1772</td>\n",
       "      <td>2014-06-16</td>\n",
       "      <td>2024-03-12 21:44:31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>602743</td>\n",
       "      <td>2199</td>\n",
       "      <td>White, Jarrett T</td>\n",
       "      <td>Full time</td>\n",
       "      <td>A</td>\n",
       "      <td>2024-03-03</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Store Asst Manager</td>\n",
       "      <td>1782</td>\n",
       "      <td>2020-02-12</td>\n",
       "      <td>2024-03-12 21:44:24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>607724</td>\n",
       "      <td>2199</td>\n",
       "      <td>Penrod, Joshua A</td>\n",
       "      <td>Full time</td>\n",
       "      <td>A</td>\n",
       "      <td>2024-06-23</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Store Asst Manager</td>\n",
       "      <td>1782</td>\n",
       "      <td>2020-08-17</td>\n",
       "      <td>2024-03-12 21:44:29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>644863</td>\n",
       "      <td>2199</td>\n",
       "      <td>Keifer, Samule</td>\n",
       "      <td>Full time</td>\n",
       "      <td>A</td>\n",
       "      <td>2022-05-27</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Store Asst Manager</td>\n",
       "      <td>1782</td>\n",
       "      <td>2022-05-27</td>\n",
       "      <td>2024-03-12 21:44:25</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   employee_identifier  site_number                 full_name  \\\n",
       "0               316846         2199          Pickens, Jacob H   \n",
       "1               525040         2199  Apodaca Cordova, Jesus A   \n",
       "2               602743         2199          White, Jarrett T   \n",
       "3               607724         2199          Penrod, Joshua A   \n",
       "4               644863         2199            Keifer, Samule   \n",
       "\n",
       "  employee_type_name employment_status_code position_effective_start_date  \\\n",
       "0          Full time                      A                    2024-08-01   \n",
       "1          Full time                      A                    2023-04-23   \n",
       "2          Full time                      A                    2024-03-03   \n",
       "3          Full time                      A                    2024-06-23   \n",
       "4          Full time                      A                    2022-05-27   \n",
       "\n",
       "  effective_termination_date          position_name  position_job_code  \\\n",
       "0                        NaN          Store Manager               1752   \n",
       "1                        NaN  Store Sr Asst Manager               1772   \n",
       "2                        NaN     Store Asst Manager               1782   \n",
       "3                        NaN     Store Asst Manager               1782   \n",
       "4                        NaN     Store Asst Manager               1782   \n",
       "\n",
       "  original_hire_date     create_timestamp  \n",
       "0         2000-10-09  2024-03-12 21:44:27  \n",
       "1         2014-06-16  2024-03-12 21:44:31  \n",
       "2         2020-02-12  2024-03-12 21:44:24  \n",
       "3         2020-08-17  2024-03-12 21:44:29  \n",
       "4         2022-05-27  2024-03-12 21:44:25  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "employee = pd.read_csv(\"../data/employee.csv\")\n",
    "employee.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "e43d0693-91d7-4e27-80e2-22be4c7fd86a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "employee_identifier              45288\n",
       "site_number                      45288\n",
       "full_name                        45288\n",
       "employee_type_name               45288\n",
       "employment_status_code           45288\n",
       "position_effective_start_date    45288\n",
       "effective_termination_date       17341\n",
       "position_name                    45288\n",
       "position_job_code                45288\n",
       "original_hire_date               45288\n",
       "create_timestamp                 45288\n",
       "dtype: int64"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "employee.count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "0906d019-d39d-4d48-8be7-b24a23e77a62",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>sales_order_identifier</th>\n",
       "      <th>create_employee_identifier</th>\n",
       "      <th>sales_order_created_date</th>\n",
       "      <th>article_number</th>\n",
       "      <th>sold_quantity</th>\n",
       "      <th>retail_price</th>\n",
       "      <th>discount_amount</th>\n",
       "      <th>net_price</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>800004001</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2023-07-11</td>\n",
       "      <td>25769</td>\n",
       "      <td>1</td>\n",
       "      <td>354.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>354.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>800004001</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2023-07-11</td>\n",
       "      <td>80007</td>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>-1.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>800004002</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2023-08-03</td>\n",
       "      <td>128721</td>\n",
       "      <td>1</td>\n",
       "      <td>182.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>182.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>800004002</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2023-08-03</td>\n",
       "      <td>91250</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>800005001</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2023-07-11</td>\n",
       "      <td>80085</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>15.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   sales_order_identifier  create_employee_identifier  \\\n",
       "0               800004001                         NaN   \n",
       "1               800004001                         NaN   \n",
       "2               800004002                         NaN   \n",
       "3               800004002                         NaN   \n",
       "4               800005001                         NaN   \n",
       "\n",
       "  sales_order_created_date  article_number  sold_quantity  retail_price  \\\n",
       "0               2023-07-11           25769              1         354.0   \n",
       "1               2023-07-11           80007              1           1.0   \n",
       "2               2023-08-03          128721              1         182.0   \n",
       "3               2023-08-03           91250              1           0.0   \n",
       "4               2023-07-11           80085              1           0.0   \n",
       "\n",
       "   discount_amount  net_price  \n",
       "0              0.0      354.0  \n",
       "1             -1.0        0.0  \n",
       "2              0.0      182.0  \n",
       "3              0.0        0.0  \n",
       "4              0.0       15.0  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sales = pd.read_csv(\"../data/sales.csv\")\n",
    "sales.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "858af79a-8592-49ba-89e8-20e9ad64c642",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "sales_order_identifier        50000\n",
       "create_employee_identifier    39854\n",
       "sales_order_created_date      50000\n",
       "article_number                50000\n",
       "sold_quantity                 50000\n",
       "retail_price                  50000\n",
       "discount_amount               50000\n",
       "net_price                     50000\n",
       "dtype: int64"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sales.count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "4570b871-8f4a-4e2e-92d3-110723fa36a0",
   "metadata": {},
   "outputs": [],
   "source": [
    "sales['sales_order_created_date_rank'] = sales.groupby('sales_order_identifier')['sales_order_created_date'].rank(method='first')\n",
    "df = sales[sales['sales_order_created_date_rank']==1]\n",
    "df = df.drop('sales_order_created_date_rank', axis=1)\n",
    "df.count()\n",
    "df.to_csv('../data/sales_curated.csv', index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "2e2e2770-122f-4fea-a0ce-df73e5235513",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>inventory_id</th>\n",
       "      <th>site_number</th>\n",
       "      <th>article_number</th>\n",
       "      <th>reserved_quantity</th>\n",
       "      <th>on_hand_quantity</th>\n",
       "      <th>available_quantity</th>\n",
       "      <th>in_transit_quantity</th>\n",
       "      <th>layaway_quantity</th>\n",
       "      <th>weborder_quantity</th>\n",
       "      <th>inventory_date</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>11082</td>\n",
       "      <td>1007</td>\n",
       "      <td>10075</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2024-04-11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>11164</td>\n",
       "      <td>1007</td>\n",
       "      <td>10157</td>\n",
       "      <td>4</td>\n",
       "      <td>0.0</td>\n",
       "      <td>-4</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2024-07-17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>11164</td>\n",
       "      <td>1007</td>\n",
       "      <td>10157</td>\n",
       "      <td>4</td>\n",
       "      <td>2.0</td>\n",
       "      <td>-2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2024-07-18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>11164</td>\n",
       "      <td>1007</td>\n",
       "      <td>10157</td>\n",
       "      <td>4</td>\n",
       "      <td>4.0</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2024-07-20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>11164</td>\n",
       "      <td>1007</td>\n",
       "      <td>10157</td>\n",
       "      <td>0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2024-07-22</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   inventory_id  site_number  article_number  reserved_quantity  \\\n",
       "0         11082         1007           10075                  0   \n",
       "1         11164         1007           10157                  4   \n",
       "2         11164         1007           10157                  4   \n",
       "3         11164         1007           10157                  4   \n",
       "4         11164         1007           10157                  0   \n",
       "\n",
       "   on_hand_quantity  available_quantity  in_transit_quantity  \\\n",
       "0               0.0                   0                  NaN   \n",
       "1               0.0                  -4                  NaN   \n",
       "2               2.0                  -2                  NaN   \n",
       "3               4.0                   0                  NaN   \n",
       "4               0.0                   0                  NaN   \n",
       "\n",
       "   layaway_quantity  weborder_quantity inventory_date  \n",
       "0               NaN                NaN     2024-04-11  \n",
       "1               NaN                NaN     2024-07-17  \n",
       "2               NaN                NaN     2024-07-18  \n",
       "3               NaN                NaN     2024-07-20  \n",
       "4               NaN                NaN     2024-07-22  "
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "inventory = pd.read_csv(\"../data/inventory.csv\")\n",
    "inventory.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "4fcd6c01-61d5-4ec2-b1e8-1686813710b0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "inventory_id           50000\n",
       "site_number            50000\n",
       "article_number         50000\n",
       "reserved_quantity      50000\n",
       "on_hand_quantity       49924\n",
       "available_quantity     50000\n",
       "in_transit_quantity    20667\n",
       "layaway_quantity       20667\n",
       "weborder_quantity      20667\n",
       "inventory_date         50000\n",
       "dtype: int64"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "inventory.count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "145d8569-d324-4077-9cf4-9036690f8a6e",
   "metadata": {},
   "outputs": [],
   "source": [
    "inventory['inventory_date_rank'] = inventory.groupby('inventory_id')['inventory_date'].rank(method='first')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "a287104c-ef29-4def-a899-137417ff7b63",
   "metadata": {},
   "outputs": [],
   "source": [
    "df = inventory[inventory['inventory_date_rank']==1]\n",
    "df = df.drop('inventory_date_rank', axis=1)\n",
    "df.to_csv('../data/article_inventory.csv', index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "75700197",
   "metadata": {},
   "source": [
    "## 5. Connect to Memgraph with GQLAlchemy <a name=\"connect\"></a>\n",
    "\n",
    "We will use the **GQLAlchemy**'s object graph mapper (OGM) to connect to Memgraph and quickly execute **Cypher** queries. GQLAlchemy also serves as a Python driver/client for Memgraph. We can install it using:\n",
    "```\n",
    "pip install gqlalchemy==1.3.2\n",
    "```\n",
    "> You may need to install [CMake](https://cmake.org/download/) before installing GQLAlchemy."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "e91e3efe",
   "metadata": {},
   "outputs": [],
   "source": [
    "from gqlalchemy import Memgraph\n",
    "\n",
    "memgraph = Memgraph(\"127.0.0.1\", 7687)\n",
    "memgraph.drop_database()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "1ffcea1a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'number_of_nodes': 0}\n"
     ]
    }
   ],
   "source": [
    "results = memgraph.execute_and_fetch(\n",
    "    \"\"\"\n",
    "    MATCH (n) RETURN count(n) AS number_of_nodes ;\n",
    "    \"\"\"\n",
    ")\n",
    "print(next(results))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8d3acc5c",
   "metadata": {},
   "source": [
    "## 6. Define a Graph Data Model <a name=\"graph-schema\"></a>\n",
    "\n",
    "Next, we have to define the above graph schema in the Python code. This is where **GQLAlchemy** steps in with its Object Graph Mapper."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "53c11afe",
   "metadata": {},
   "outputs": [],
   "source": [
    "from typing import Optional\n",
    "from gqlalchemy import Node, Relationship, Field\n",
    "\n",
    "\n",
    "class Site(Node):\n",
    "    site_id: int = Field(index=True, exists=True, db=memgraph)\n",
    "    store_code      : Optional[str]   = Field()\n",
    "    site_name       : Optional[str]   = Field()\n",
    "    site_address    : Optional[str]   = Field()\n",
    "    lat             : Optional[float] = Field()\n",
    "    lng             : Optional[float] = Field()\n",
    "\n",
    "\n",
    "class Article(Node):\n",
    "    article_id: int = Field(index=True, unique=True, exists=True, db=memgraph)\n",
    "    article_type_code         : Optional[str] = Field()\n",
    "    created_date              : Optional[str] = Field()\n",
    "    manufacturer_code         : Optional[str] = Field()\n",
    "    gross_weight              : Optional[str] = Field()\n",
    "    net_weight                : Optional[str] = Field()\n",
    "    speed_rating_code         : Optional[str] = Field()\n",
    "    tire_cross_section_number : Optional[str] = Field()\n",
    "    tire_aspect_ratio         : Optional[str] = Field()\n",
    "    tire_rim_size_number      : Optional[str] = Field()\n",
    "    tread_depth               : Optional[str] = Field()\n",
    "    tire_load_capacity        : Optional[str] = Field()\n",
    "    tire_load_index           : Optional[str] = Field()\n",
    "    wheel_offset_number       : Optional[str] = Field()\n",
    "    wheel_diameter_number     : Optional[str] = Field()\n",
    "    wheel_style_code          : Optional[str] = Field()\n",
    "    wheel_bolt_pattern        : Optional[str] = Field()\n",
    "    wheel_accent_code         : Optional[str] = Field()\n",
    "    spoke_100mm_depth         : Optional[str] = Field()\n",
    "    spoke_120mm_depth         : Optional[str] = Field()\n",
    "    spoke_160mm_depth         : Optional[str] = Field()\n",
    "    spoke_90mm_depth          : Optional[str] = Field()\n",
    "    merchandise_category_code : Optional[str] = Field()\n",
    "\n",
    "\n",
    "class Employee(Node):\n",
    "    employee_id: int = Field(index=True, unique=True, exists=True, db=memgraph)\n",
    "    site_number                    : Optional[int] = Field()\n",
    "    full_name                      : Optional[str] = Field()\n",
    "    employee_type_name             : Optional[str] = Field()\n",
    "    employment_status_code         : Optional[str] = Field()\n",
    "    position_effective_start_date  : Optional[str] = Field()\n",
    "    effective_termination_date     : Optional[str] = Field()\n",
    "    position_name                  : Optional[str] = Field()\n",
    "    position_job_code              : Optional[str] = Field()\n",
    "    original_hire_date             : Optional[str] = Field()\n",
    "    create_timestamp               : Optional[str] = Field()\n",
    "\n",
    "\n",
    "class Inventory(Node):\n",
    "    inventory_id: int = Field(index=True, unique=True, exists=True, db=memgraph)\n",
    "    site_number            : Optional[int] = Field()\n",
    "    article_number         : Optional[int] = Field()\n",
    "    reserved_quantity      : Optional[int] = Field()\n",
    "    on_hand_quantity       : Optional[int] = Field()\n",
    "    available_quantity     : Optional[int] = Field()\n",
    "    in_transit_quantity    : Optional[int] = Field()\n",
    "    layaway_quantity       : Optional[int] = Field()\n",
    "    weborder_quantity      : Optional[int] = Field()\n",
    "    inventory_date         : Optional[str] = Field()\n",
    "\n",
    "\n",
    "class Sales(Node):\n",
    "    sales_id: int = Field(index=True, unique=True, exists=True, db=memgraph)\n",
    "    employee_number               : Optional[int] = Field()\n",
    "    article_number                : Optional[int] = Field()\n",
    "    sales_order_created_date      : Optional[str] = Field()\n",
    "    sold_quantity                 : Optional[int] = Field()\n",
    "    retail_price                  : float = Field()\n",
    "    discount_amount               : float = Field()\n",
    "    net_price   \t\t\t\t  : float = Field()\n",
    "\n",
    "\n",
    "class OwnInventory(Relationship, type=\"OWN\"):\n",
    "    r_id: int = Field(index=True, unique=True, exists=True, db=memgraph)\n",
    "    inventory_id       : Optional[int] = Field()\n",
    "    site_id            : Optional[int] = Field()\n",
    "    create_timestamp   : Optional[str] = Field()\n",
    "\n",
    "\n",
    "class CreateSales(Relationship, type=\"CREATES\"):\n",
    "    r_id: int = Field(index=True, unique=True, exists=True, db=memgraph)\n",
    "    employee_id        : Optional[int] = Field()\n",
    "    sales_id           : Optional[int] = Field()\n",
    "    create_timestamp   : Optional[str] = Field()\n",
    "\n",
    "\n",
    "class BelongtoSite(Relationship, type=\"BELONGS\"):\n",
    "    r_id: int = Field(index=True, unique=True, exists=True, db=memgraph)\n",
    "    employee_id        : Optional[int] = Field()\n",
    "    site_id            : Optional[int] = Field()\n",
    "    create_timestamp   : Optional[str] = Field()\n",
    "\n",
    "\n",
    "class SellArticle(Relationship, type=\"SOLD\"):\n",
    "    r_id: int = Field(index=True, unique=True, exists=True, db=memgraph)\n",
    "    sales_id           : Optional[int] = Field()\n",
    "    article_id         : Optional[int] = Field()\n",
    "    create_timestamp   : Optional[str] = Field()\n",
    "\n",
    "\n",
    "class InventoryHoldArticle(Relationship, type=\"Hold\"):\n",
    "    r_id: int = Field(index=True, unique=True, exists=True, db=memgraph)\n",
    "    inventory_id       : Optional[int] = Field()\n",
    "    article_id         : Optional[int] = Field()\n",
    "    create_timestamp   : Optional[str] = Field()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e958d8ed",
   "metadata": {},
   "source": [
    "## 7. Creating and returning nodes and relationships <a name=\"create-return\"></a>\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "0dfccf29",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "# article_node = Article(id=10000, \n",
    "#                        article_description=\"YOKOHAMA TEAM REBATE\", \n",
    "#                        article_type_code=\"ZPRO\")\n",
    "# article_node.save(memgraph)\n",
    "\n",
    "# print(article_node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "f717c253-3673-4225-a02a-c44c395c603d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# site_node = Site(id=100000,\n",
    "#                  site_name=\"DTD PHOENIX AZ (WDAZ01)\",\n",
    "#                  site_address=\"2300 S 51ST AVESTE 140\",\n",
    "#                  site_state_code=\"AZ\",\n",
    "#                  lat=33.426933,\n",
    "#                  lng=-112.171425)\n",
    "# site_node.save(memgraph)\n",
    "# print(site_node)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e540697d",
   "metadata": {},
   "source": [
    "We can validate it from Memgraph Lab:\n",
    "```\n",
    "MATCH (n)\n",
    "RETURN *;\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "94702cfc",
   "metadata": {},
   "source": [
    "Next, let's create a relationship of type `Sales` between the existing `Site` and `Article` nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "43e50fd0",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "# sales_relationship = Sales(_start_node_id=site_node._id, \n",
    "#                            _end_node_id=article_node._id, \n",
    "#                            sold_quantity=100, \n",
    "#                            retail_price=988.90,\n",
    "#                            sales_timestamp=\"2024-12-25 21:43:16\")\n",
    "\n",
    "# sales_relationship.save(memgraph)\n",
    "\n",
    "# print(sales_relationship)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "787855a4",
   "metadata": {},
   "source": [
    "we can validate it from Memgraph Lab:\n",
    "```\n",
    "MATCH (n)-[r]->(m)\n",
    "RETURN *;\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f2277c50",
   "metadata": {},
   "source": [
    "## 8. Importing data from CSV files <a name=\"import\"></a>\n",
    "\n",
    "First, let's clean up the database to import only data from the CSV files.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "dae2543a",
   "metadata": {},
   "outputs": [],
   "source": [
    "memgraph.drop_database()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5b465fca",
   "metadata": {},
   "source": [
    "Now we nee to import `movies.csv` and `ratings.csv` files into Memgraph, by copying them from the [data folder](../data) into the Docker container where Memgraph is running. First, place yourself into the data folder. Next, find the `CONTAINER_ID` by running:\n",
    "\n",
    "```\n",
    "docker ps\n",
    "```\n",
    "\n",
    "Copy the files with the following commands (don't forget to replace `CONTAINER_ID`):\n",
    "\n",
    "```\n",
    "docker cp article_inventory.csv 3910733944a2:article_inventory.csv\n",
    "docker cp employee.csv 3910733944a2:employee.csv\n",
    "docker cp product.csv 3910733944a2:product.csv\n",
    "docker cp sales_curated.csv 3910733944a2:sales_curated.csv\n",
    "docker cp site.csv 3910733944a2:site.csv\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "be194ec4",
   "metadata": {},
   "source": [
    "We will import data to Memgraph using the `LOAD CSV` Cypher clause that enables us to load and use data from a CSV file of our choosing in a row-based manner within a query. Memgraph supports the Excel CSV dialect, the most common one. For more info, check out [Memgraph Docs](https://memgraph.com/docs/memgraph/import-data/load-csv-clause).\n",
    "\n",
    "The following method will run the `LOAD CSV` clause inside Memgraph and create `Movie` and `Genre` nodes and the `OF_GENRE` relationship between them."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "c40e8239",
   "metadata": {},
   "outputs": [],
   "source": [
    "memgraph.execute(\n",
    "    \"\"\"\n",
    "    LOAD CSV FROM \"/site.csv\" WITH HEADER AS row\n",
    "    CREATE (s:Site {\n",
    "    site_id       : toInteger(row.site_number), \n",
    "    store_code    : row.store_code,     \n",
    "    site_name  \t  : row.site_name, \n",
    "    site_address  : row.site_address, \n",
    "    lat\t\t      : row.latitude, \n",
    "    lng\t\t      : row.longitude\n",
    "    }) \n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "d99f73a5-1513-45de-b03c-dbf97566fc64",
   "metadata": {},
   "outputs": [],
   "source": [
    "memgraph.execute(\n",
    "    \"\"\"\n",
    "    LOAD CSV FROM \"/product.csv\" WITH HEADER AS row\n",
    "    CREATE (a:Article {article_id: toInteger(row.article_number), \n",
    "    article_type_code         : row.article_type_code         ,\n",
    "    created_date              : row.created_date              ,\n",
    "    manufacturer_code         : row.manufacturer_code         ,\n",
    "    gross_weight              : row.gross_weight              ,\n",
    "    net_weight                : row.net_weight                ,\n",
    "    speed_rating_code         : row.speed_rating_code         ,\n",
    "    tire_cross_section_number : row.tire_cross_section_number ,\n",
    "    tire_aspect_ratio         : row.tire_aspect_ratio         ,\n",
    "    tire_rim_size_number      : row.tire_rim_size_number      ,\n",
    "    tread_depth               : row.tread_depth               ,\n",
    "    tire_load_capacity        : row.tire_load_capacity        ,\n",
    "    tire_load_index           : row.tire_load_index           ,\n",
    "    wheel_offset_number       : row.wheel_offset_number       ,\n",
    "    wheel_diameter_number     : row.wheel_diameter_number     ,\n",
    "    wheel_style_code          : row.wheel_style_code          ,\n",
    "    wheel_bolt_pattern        : row.wheel_bolt_pattern        ,\n",
    "    wheel_accent_code         : row.wheel_accent_code         ,\n",
    "    spoke_100mm_depth         : row.spoke_100mm_depth         ,\n",
    "    spoke_120mm_depth         : row.spoke_120mm_depth         ,\n",
    "    spoke_160mm_depth         : row.spoke_160mm_depth         ,\n",
    "    spoke_90mm_depth          : row.spoke_90mm_depth          ,\n",
    "    merchandise_category_code : row.merchandise_category_code }) \n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "f9434a5e",
   "metadata": {},
   "outputs": [],
   "source": [
    "memgraph.execute(\n",
    "    \"\"\"\n",
    "    LOAD CSV FROM \"/employee.csv\" WITH HEADER AS row\n",
    "    CREATE (e:Employee {employee_id: toInteger(row.employee_identifier), \n",
    "    site_number                    : row.site_number,\n",
    "    full_name                      : row.full_name                    ,\n",
    "    employee_type_name             : row.employee_type_name           ,\n",
    "    employment_status_code         : row.employment_status_code       ,\n",
    "    position_effective_start_date  : row.position_effective_start_date,\n",
    "    effective_termination_date     : row.effective_termination_date   ,\n",
    "    position_name                  : row.position_name                ,\n",
    "    position_job_code              : row.position_job_code            ,\n",
    "    original_hire_date             : row.original_hire_date           ,\n",
    "    create_timestamp               : row.db_create_timestamp          \n",
    "    }) \n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "0a3d1c42-8fb5-4287-ad9a-f0e6191f472f",
   "metadata": {},
   "outputs": [],
   "source": [
    "memgraph.execute(\n",
    "    \"\"\"\n",
    "    LOAD CSV FROM \"/article_inventory.csv\" WITH HEADER AS row\n",
    "    CREATE (i:Inventory {\n",
    "    inventory_id           : toInteger(row.inventory_id),\n",
    "    site_number            : toInteger(row.site_number),\n",
    "    article_number         : toInteger(row.article_number),\n",
    "    reserved_quantity      : toInteger(row.reserved_quantity),\n",
    "    on_hand_quantity       : toInteger(row.on_hand_quantity),\n",
    "    available_quantity     : toInteger(row.available_quantity),\n",
    "    in_transit_quantity    : toInteger(row.in_transit_quantity),\n",
    "    layaway_quantity       : toInteger(row.layaway_quantity),\n",
    "    weborder_quantity      : toInteger(row.weborder_quantity),\n",
    "    inventory_date         : toString(row.inventory_date)\n",
    "    })\n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "ef0280e4-34c4-4b16-b950-aaacc41608f8",
   "metadata": {},
   "outputs": [],
   "source": [
    "memgraph.execute(\n",
    "    \"\"\"\n",
    "    LOAD CSV FROM \"/sales_curated.csv\" WITH HEADER AS row\n",
    "    CREATE (s:Sales {\n",
    "    sales_id                      : toInteger(row.sales_order_identifier),\n",
    "    employee_number               : toInteger(row.create_employee_identifier),\n",
    "    article_number                : toInteger(row.article_number),\n",
    "    sales_order_created_date      : toString(row.sales_order_created_date), \n",
    "    sold_quantity                 : toInteger(row.sold_quantity), \n",
    "    retail_price                  : toFloat(row.retail_price), \n",
    "    discount_amount               : toFloat(row.discount_amount), \n",
    "    net_price   \t\t\t\t  : toFloat(row.net_price)\n",
    "    })\n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "ab5e252d-b2c4-4a7a-853a-9f918fd62ee5",
   "metadata": {},
   "outputs": [],
   "source": [
    "memgraph.execute(\n",
    "    \"\"\"\n",
    "    LOAD CSV FROM \"/article_inventory.csv\" WITH HEADER AS row\n",
    "    MATCH (s:Site {site_id: toInteger(row.site_number)})\n",
    "    MATCH (i:Inventory {inventory_id: toInteger(row.inventory_id)})\n",
    "    MERGE (s)-[:OwnInventory {\n",
    "    r_id              : toInteger(row.site_number) + toInteger(row.inventory_id),\n",
    "    site_id           : toInteger(row.site_number),\n",
    "    inventory_id      : toInteger(row.inventory_id),\n",
    "    create_timestamp  : toString(row.db_create_timestamp)\n",
    "    }]->(i);\n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "f54ad53f-7b7f-4cdd-b6c5-f66d0873a8b4",
   "metadata": {},
   "outputs": [],
   "source": [
    "memgraph.execute(\n",
    "    \"\"\"\n",
    "    LOAD CSV FROM \"/sales_curated.csv\" WITH HEADER AS row\n",
    "    MATCH (s:Sales {sales_id: toInteger(row.sales_order_identifier)})\n",
    "    MATCH (e:Employee {employee_id: toInteger(row.create_employee_identifier)})\n",
    "    MERGE (e)-[:CreateSales {\n",
    "    r_id              : toInteger(row.sales_order_identifier) + toInteger(row.create_employee_identifier),\n",
    "    sales_id          : toInteger(row.sales_order_identifier),\n",
    "    employee_id       : toInteger(row.create_employee_identifier),\n",
    "    create_timestamp  : toString(row.db_create_timestamp)\n",
    "    }]->(s);\n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "c10f432f-3315-4a78-a285-33e45576ba10",
   "metadata": {},
   "outputs": [],
   "source": [
    "memgraph.execute(\n",
    "    \"\"\"\n",
    "    LOAD CSV FROM \"/employee.csv\" WITH HEADER AS row\n",
    "    MATCH (s:Site {site_id: toInteger(row.site_number)})\n",
    "    MATCH (e:Employee {employee_id: toInteger(row.employee_identifier)})\n",
    "    MERGE (e)-[:BelongtoSite {\n",
    "    r_id              : toInteger(row.site_number) + toInteger(row.employee_identifier),\n",
    "    site_id          : toInteger(row.site_number),\n",
    "    employee_id       : toInteger(row.employee_identifier),\n",
    "    create_timestamp  : toString(row.db_create_timestamp)\n",
    "    }]->(s);\n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "2446dffd-753a-4e65-8257-a6ea792e3b3f",
   "metadata": {},
   "outputs": [],
   "source": [
    "memgraph.execute(\n",
    "    \"\"\"\n",
    "    LOAD CSV FROM \"/sales_curated.csv\" WITH HEADER AS row\n",
    "    MATCH (s:Sales {sales_id: toInteger(row.sales_order_identifier)})\n",
    "    MATCH (a:Article {article_id: toInteger(row.article_number)})\n",
    "    MERGE (s)-[:SellArticle {\n",
    "    r_id              : toInteger(row.sales_order_identifier) + toInteger(row.article_number),\n",
    "    sales_id          : toInteger(row.sales_order_identifier),\n",
    "    article_id        : toInteger(row.article_number),\n",
    "    create_timestamp  : toString(row.db_create_timestamp)\n",
    "    }]->(a);\n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "b7151100-a828-4fd2-b4fc-99e3d390ec07",
   "metadata": {},
   "outputs": [],
   "source": [
    "memgraph.execute(\n",
    "    \"\"\"\n",
    "    LOAD CSV FROM \"/article_inventory.csv\" WITH HEADER AS row\n",
    "    MATCH (i:Inventory {inventory_id: toInteger(row.inventory_id)})\n",
    "    MATCH (a:Article {article_id: toInteger(row.article_number)})\n",
    "    MERGE (i)-[:HoldArticle {\n",
    "    r_id              : toInteger(row.inventory_id) + toInteger(row.article_number),\n",
    "    inventory_id      : toInteger(row.sales_order_identifier),\n",
    "    article_id        : toInteger(row.article_number),\n",
    "    create_timestamp  : toString(row.db_create_timestamp)\n",
    "    }]->(a);\n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7b7b577d",
   "metadata": {},
   "source": [
    "Great! We imported all the data into Memgraph. Feel free to check it out in Memgraph Lab at `localhost:3000`."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3c182648",
   "metadata": {},
   "source": [
    "## 9. Querying the database and retrieving results <a name=\"query\"></a>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a4ee5d55",
   "metadata": {},
   "source": [
    "The simplest usage of the **Cypher query language** is to find data stored in the database. For that, you can use one of the following clauses:\n",
    "\n",
    "- `MATCH` which searches for patterns.\n",
    "- `WHERE` for filtering the matched data.\n",
    "- `RETURN` for defining what will be presented to the user in the result set.\n",
    "- `UNION` and `UNION ALL` for combining results from multiple queries.\n",
    "- `UNWIND` for unwinding a list of values as individual rows.\n",
    "\n",
    "Let's create a simple `MATCH` query to find all movies and order them by their title in ascending order."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "837c4220",
   "metadata": {},
   "outputs": [],
   "source": [
    "results = memgraph.execute_and_fetch(\n",
    "    \"\"\"\n",
    "    MATCH (n:Site)\n",
    "    RETURN n\n",
    "    ORDER BY n.site_name ASC\n",
    "    LIMIT 10;\n",
    "    \"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "87dfd43d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Site id=479289 labels={'Site'} properties={'site_id': 2098, 'store_code': 'FLJ 10', 'site_name': '103RD ST (FLJ 10)', 'site_address': '7273 103RD ST', 'lat': 30.248608, 'lng': -81.766545}>\n",
      "<Site id=478729 labels={'Site'} properties={'site_id': 1515, 'store_code': 'COD 27', 'site_name': '104TH (COD 27)', 'site_address': '3805 E 104TH AVE', 'lat': 39.885054, 'lng': -104.942006}>\n",
      "<Site id=479246 labels={'Site'} properties={'site_id': 2055, 'store_code': 'KSK 03', 'site_name': '119TH ST (KSK 03)', 'site_address': '11640 METCALF AVE', 'lat': 38.915491, 'lng': -94.669252}>\n",
      "<Site id=478826 labels={'Site'} properties={'site_id': 1618, 'store_code': 'TXD 60', 'site_name': '121 CUSTER (TXD 60)', 'site_address': '2260 STATE HIGHWAY 121', 'lat': 33.123562, 'lng': -96.735395}>\n",
      "<Site id=478736 labels={'Site'} properties={'site_id': 1522, 'store_code': 'MID 11', 'site_name': '14 MILE RD (MID 11)', 'site_address': '1125 E 14 MILE RD#1137', 'lat': 42.534588, 'lng': -83.097343}>\n",
      "<Site id=479183 labels={'Site'} properties={'site_id': 1989, 'store_code': 'KSK 01', 'site_name': '153RD ST (KSK 01)', 'site_address': '20050 W 153RD ST', 'lat': 38.85211, 'lng': -94.817113}>\n",
      "<Site id=478287 labels={'Site'} properties={'site_id': 1028, 'store_code': 'AZP 26', 'site_name': '15TH & BELL (AZP 26)', 'site_address': '1530 W BELL RD', 'lat': 33.640388, 'lng': -112.09246}>\n",
      "<Site id=479285 labels={'Site'} properties={'site_id': 2094, 'store_code': 'TXC 19', 'site_name': '281 & CANTON (TXC 19)', 'site_address': '2700 S INTERSTATE 69C', 'lat': 26.274519, 'lng': -98.151031}>\n",
      "<Site id=478343 labels={'Site'} properties={'site_id': 1088, 'store_code': 'COB 01', 'site_name': '28TH ST (COB 01)', 'site_address': '3215 28TH ST', 'lat': 40.03319, 'lng': -105.258607}>\n",
      "<Site id=478389 labels={'Site'} properties={'site_id': 1142, 'store_code': 'MIG 07', 'site_name': '28TH ST SE (MIG 07)', 'site_address': '2649 28TH ST SE', 'lat': 42.912763, 'lng': -85.601739}>\n"
     ]
    }
   ],
   "source": [
    "results = list(results)\n",
    "\n",
    "for result in results:\n",
    "    print(result[\"n\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f2e57132",
   "metadata": {},
   "source": [
    "We may wonder whether these results have been correctly serialized back to the defined schema. We can check that out:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "8c77df3b",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Site:  28TH ST (COB 01)\n",
      "Type:  <class '__main__.Site'>\n"
     ]
    }
   ],
   "source": [
    "n = results[8][\"n\"]\n",
    "\n",
    "print(\"Site: \", n.site_name)\n",
    "print(\"Type: \", type(n))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "030cf990",
   "metadata": {},
   "source": [
    "If you're not keen on Cypher query language, you can try out the GQLAlchemy **query builder**. Let's rewrite the above Cypher query with the help of the query builder:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "f8721836",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Site id=479289 labels={'Site'} properties={'site_id': 2098, 'store_code': 'FLJ 10', 'site_name': '103RD ST (FLJ 10)', 'site_address': '7273 103RD ST', 'lat': 30.248608, 'lng': -81.766545}>\n",
      "<Site id=478729 labels={'Site'} properties={'site_id': 1515, 'store_code': 'COD 27', 'site_name': '104TH (COD 27)', 'site_address': '3805 E 104TH AVE', 'lat': 39.885054, 'lng': -104.942006}>\n",
      "<Site id=479246 labels={'Site'} properties={'site_id': 2055, 'store_code': 'KSK 03', 'site_name': '119TH ST (KSK 03)', 'site_address': '11640 METCALF AVE', 'lat': 38.915491, 'lng': -94.669252}>\n",
      "<Site id=478826 labels={'Site'} properties={'site_id': 1618, 'store_code': 'TXD 60', 'site_name': '121 CUSTER (TXD 60)', 'site_address': '2260 STATE HIGHWAY 121', 'lat': 33.123562, 'lng': -96.735395}>\n",
      "<Site id=478736 labels={'Site'} properties={'site_id': 1522, 'store_code': 'MID 11', 'site_name': '14 MILE RD (MID 11)', 'site_address': '1125 E 14 MILE RD#1137', 'lat': 42.534588, 'lng': -83.097343}>\n",
      "<Site id=479183 labels={'Site'} properties={'site_id': 1989, 'store_code': 'KSK 01', 'site_name': '153RD ST (KSK 01)', 'site_address': '20050 W 153RD ST', 'lat': 38.85211, 'lng': -94.817113}>\n",
      "<Site id=478287 labels={'Site'} properties={'site_id': 1028, 'store_code': 'AZP 26', 'site_name': '15TH & BELL (AZP 26)', 'site_address': '1530 W BELL RD', 'lat': 33.640388, 'lng': -112.09246}>\n",
      "<Site id=479285 labels={'Site'} properties={'site_id': 2094, 'store_code': 'TXC 19', 'site_name': '281 & CANTON (TXC 19)', 'site_address': '2700 S INTERSTATE 69C', 'lat': 26.274519, 'lng': -98.151031}>\n",
      "<Site id=478343 labels={'Site'} properties={'site_id': 1088, 'store_code': 'COB 01', 'site_name': '28TH ST (COB 01)', 'site_address': '3215 28TH ST', 'lat': 40.03319, 'lng': -105.258607}>\n",
      "<Site id=478389 labels={'Site'} properties={'site_id': 1142, 'store_code': 'MIG 07', 'site_name': '28TH ST SE (MIG 07)', 'site_address': '2649 28TH ST SE', 'lat': 42.912763, 'lng': -85.601739}>\n"
     ]
    }
   ],
   "source": [
    "from gqlalchemy import match\n",
    "from gqlalchemy.query_builders.memgraph_query_builder import Order\n",
    "\n",
    "results_from_qb = (\n",
    "    match()\n",
    "    .node(labels=\"Site\", variable=\"s\")\n",
    "    .return_()\n",
    "    .order_by((\"s.site_name\", Order.ASC))\n",
    "    .limit(10)\n",
    "    .execute()\n",
    ")\n",
    "results_from_qb = list(results_from_qb)\n",
    "\n",
    "for result in results_from_qb:\n",
    "    print(result[\"s\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2710753a",
   "metadata": {},
   "source": [
    "As expected, the result is the same as above.\n",
    "\n",
    "## 10. Use Case queries  <a name=\"exercises\"></a>\n",
    "\n",
    "\n",
    "### 🔷 Use Case 1: Find out how many Articles there are in the database.\n",
    "\n",
    "The correct Cypher query would be:\n",
    "\n",
    "```\n",
    "MATCH (n:Article)\n",
    "RETURN count(n) AS num_of_article;\n",
    "```\n",
    "\n",
    "You can try it out in Memgraph Lab at `localhost:3000`.\n",
    "\n",
    "With GQLAlchemy's query builder, the solution is:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "cffbded6",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "50000\n"
     ]
    }
   ],
   "source": [
    "total_users = (\n",
    "    match()\n",
    "    .node(labels=\"Article\", variable=\"u\")\n",
    "    .return_((\"count(u)\", \"num_of_article\"))\n",
    "    .execute()\n",
    ")\n",
    "\n",
    "results = list(total_users)\n",
    "for result in results:\n",
    "    print(result[\"num_of_article\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3ac7c9b4",
   "metadata": {},
   "source": [
    "### 🔷 Use Case 2: Find out how many Sales sold the Article with the type code 'ZTIR'.\n",
    "\n",
    "The correct Cypher query would be:\n",
    "\n",
    "```\n",
    "MATCH (s:Sales)-[:SoldArticle]->(:Article {article_type_code: 'ZTIR'})\n",
    "RETURN count(s) AS num_of_sales;\n",
    "```\n",
    "\n",
    "You can try it out in Memgraph Lab at `localhost:3000`.\n",
    "\n",
    "With GQLAlchemy's query builder, the solution is:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "9ee1b6ce",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "8286\n"
     ]
    }
   ],
   "source": [
    "from gqlalchemy.query_builders.memgraph_query_builder import Operator\n",
    "\n",
    "sold_alone = (\n",
    "    match()\n",
    "    .node(labels=\"Sales\", variable=\"s\")\n",
    "    .to(relationship_type=\"SellArticle\")\n",
    "    .node(labels=\"Article\", variable=\"a\")\n",
    "    .where(item=\"a.article_type_code\", operator=Operator.EQUAL, literal=\"ZTIR\")\n",
    "    .return_((\"count(s)\", \"num_of_sales\"))\n",
    "    .execute()\n",
    ")\n",
    "\n",
    "\n",
    "results = list(sold_alone)\n",
    "\n",
    "for result in results:\n",
    "    print(result[\"num_of_sales\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "02d88f7b-b4e5-4748-b210-5b18305c6848",
   "metadata": {},
   "source": [
    "### 🔷 Use Case 3: Find out the biggest sales for a type of Article.\n",
    "\n",
    "The correct Cypher query would be:\n",
    "\n",
    "```\n",
    "MATCH (s:Sales)-[r:SellArticle]->(a:Article{article_type_code: 'ZTIR'})\n",
    "RETURN s.sold_quantity * s.retail_price as total order by total DESCENDING limit 1;\n",
    "```\n",
    "\n",
    "You can try it out in Memgraph Lab at `localhost:3000`.\n",
    "\n",
    "With GQLAlchemy's query builder, the solution is:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "fae64ff7-19ff-4835-85a0-a2fa61777123",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "15288.0\n"
     ]
    }
   ],
   "source": [
    "from gqlalchemy.query_builders.memgraph_query_builder import Operator\n",
    "\n",
    "employee_alone = (\n",
    "    match()\n",
    "    .node(labels=\"Sales\", variable=\"s\")\n",
    "    .to(relationship_type=\"SellArticle\", variable=\"r\")\n",
    "    .node(labels=\"Article\", variable=\"a\")\n",
    "    .where(item=\"a.article_type_code\", operator=Operator.EQUAL, literal=\"ZTIR\")\n",
    "    .return_((\"max(s.sold_quantity * s.retail_price)\", \"total\"))\n",
    "    .execute()\n",
    ")\n",
    "\n",
    "results = list(employee_alone)\n",
    "\n",
    "for result in results:\n",
    "    print(result[\"total\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dc26f489-61b8-4166-8979-2f95f717443c",
   "metadata": {},
   "source": [
    "### 🔷 Clean up.\n",
    "\n",
    "```\n",
    "MATCH (n)\n",
    "DETACH DELETE n\n",
    "```\n",
    "\n",
    "```\n",
    "MATCH ()\n",
    "RETURN count (*)\n",
    "```\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fd518040",
   "metadata": {},
   "source": [
    "<h4 align=\"center\"><a href=#toc>⬆️ GO TO TOP ⬆️</a></h3> "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "11f67944-5a99-47d1-bb3e-7f90f9820251",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'1.4.52'"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import sqlalchemy\n",
    "sqlalchemy.__version__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "63bdd506-1bbe-450c-b3d6-036075175712",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
